[Killed] BlockStatement
src/controllers/bookController.js:9:46
 } = require('../utils/fileHandler');
 const Book = require('../models/Book');
 
-async function addBook(title, author, genre) {
-  if (!title || typeof title !== 'string' || title.trim() === '') {
-    throw new Error("Invalid input: 'title' is required and must be a non-empty string.");
-  }
-  if (!author || typeof author !== 'string' || author.trim() === '') {
-    throw new Error("Invalid input: 'author' is required and must be a non-empty string.");
-  }
-  if (!genre || typeof genre !== 'string' || genre.trim() === '') {
-    throw new Error("Invalid input: 'genre' is required and must be a non-empty string.");
-  }
-
-  const books = await readData();
-
-  const newId = books.length > 0 ? Math.max(...books.map((book) => book.id)) + 1 : 1;
-
-  const newBook = new Book(newId, title, author, genre);
-  books.push(newBook);
-
-  await writeData(books);
-
-  return newBook;
-}
+async function addBook(title, author, genre) {}
 
 async function markAsRead(bookId) {
killedBy: BookController addBook: should add a new book and return it
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
src/controllers/bookController.js:10:7
 const Book = require('../models/Book');
 
 async function addBook(title, author, genre) {
-  if (!title || typeof title !== 'string' || title.trim() === '') {
+  if (true) {
     throw new Error("Invalid input: 'title' is required and must be a non-empty string.");
   }
killedBy: BookController addBook: should add a new book and return it
statusReason: Error: Invalid input: 'title' is required and must be a non-empty string.

[Killed] BlockStatement
src/controllers/bookController.js:10:67
 const Book = require('../models/Book');
 
 async function addBook(title, author, genre) {
-  if (!title || typeof title !== 'string' || title.trim() === '') {
-    throw new Error("Invalid input: 'title' is required and must be a non-empty string.");
-  }
+  if (!title || typeof title !== 'string' || title.trim() === '') {}
   if (!author || typeof author !== 'string' || author.trim() === '') {
     throw new Error("Invalid input: 'author' is required and must be a non-empty string.");
killedBy: BookController addBook: should throw an error if invalid data is provided
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"author": "Author", "genre": "Genre", "id": 3, "isRead": false, "reviews": [], "title": ""}

[Killed] ConditionalExpression
src/controllers/bookController.js:13:7
   if (!title || typeof title !== 'string' || title.trim() === '') {
     throw new Error("Invalid input: 'title' is required and must be a non-empty string.");
   }
-  if (!author || typeof author !== 'string' || author.trim() === '') {
+  if (true) {
     throw new Error("Invalid input: 'author' is required and must be a non-empty string.");
   }
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] EqualityOperator
src/controllers/bookController.js:13:18
   if (!title || typeof title !== 'string' || title.trim() === '') {
     throw new Error("Invalid input: 'title' is required and must be a non-empty string.");
   }
-  if (!author || typeof author !== 'string' || author.trim() === '') {
+  if (!author || typeof author === 'string' || author.trim() === '') {
     throw new Error("Invalid input: 'author' is required and must be a non-empty string.");
   }
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[NoCoverage] StringLiteral
src/controllers/bookController.js:14:21
     throw new Error("Invalid input: 'title' is required and must be a non-empty string.");
   }
   if (!author || typeof author !== 'string' || author.trim() === '') {
-    throw new Error("Invalid input: 'author' is required and must be a non-empty string.");
+    throw new Error("");
   }
   if (!genre || typeof genre !== 'string' || genre.trim() === '') {

[Killed] BooleanLiteral
src/controllers/bookController.js:16:7
   if (!author || typeof author !== 'string' || author.trim() === '') {
     throw new Error("Invalid input: 'author' is required and must be a non-empty string.");
   }
-  if (!genre || typeof genre !== 'string' || genre.trim() === '') {
+  if (genre || typeof genre !== 'string' || genre.trim() === '') {
     throw new Error("Invalid input: 'genre' is required and must be a non-empty string.");
   }
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] EqualityOperator
src/controllers/bookController.js:16:46
   if (!author || typeof author !== 'string' || author.trim() === '') {
     throw new Error("Invalid input: 'author' is required and must be a non-empty string.");
   }
-  if (!genre || typeof genre !== 'string' || genre.trim() === '') {
+  if (!genre || typeof genre !== 'string' || genre.trim() !== '') {
     throw new Error("Invalid input: 'genre' is required and must be a non-empty string.");
   }
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ArrowFunction
src/controllers/bookController.js:22:58
 
   const books = await readData();
 
-  const newId = books.length > 0 ? Math.max(...books.map((book) => book.id)) + 1 : 1;
+  const newId = books.length > 0 ? Math.max(...books.map(() => undefined)) + 1 : 1;
 
   const newBook = new Book(newId, title, author, genre);
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] MethodExpression
src/controllers/bookController.js:22:36
 
   const books = await readData();
 
-  const newId = books.length > 0 ? Math.max(...books.map((book) => book.id)) + 1 : 1;
+  const newId = books.length > 0 ? Math.min(...books.map(book => book.id)) + 1 : 1;
 
   const newBook = new Book(newId, title, author, genre);
killedBy: Integration Tests POST /books should add a new book
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "id"

Expected value: 3
Received value: 2

[Killed] BlockStatement
src/controllers/bookController.js:32:35
   return newBook;
 }
 
-async function markAsRead(bookId) {
-  const books = await readData();
-  const book = books.find((b) => b.id === bookId);
-  if (!book) {
-    throw new Error('Book not found');
-  }
-  book.isRead = true;
-  await writeData(books);
-  return book;
-}
+async function markAsRead(bookId) {}
 
 async function getBooks() {
killedBy: Integration Tests POST /books/:id/markAsRead should mark a book as read
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArrowFunction
src/controllers/bookController.js:34:27
 
 async function markAsRead(bookId) {
   const books = await readData();
-  const book = books.find((b) => b.id === bookId);
+  const book = books.find(() => undefined);
   if (!book) {
     throw new Error('Book not found');
killedBy: Integration Tests POST /books/:id/markAsRead should mark a book as read
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/controllers/bookController.js:34:34
 
 async function markAsRead(bookId) {
   const books = await readData();
-  const book = books.find((b) => b.id === bookId);
+  const book = books.find((b) => false);
   if (!book) {
     throw new Error('Book not found');
killedBy: Integration Tests POST /books/:id/markAsRead should mark a book as read
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/controllers/bookController.js:35:7
 async function markAsRead(bookId) {
   const books = await readData();
   const book = books.find((b) => b.id === bookId);
-  if (!book) {
+  if (false) {
     throw new Error('Book not found');
   }
killedBy: BookController markAsRead: should throw an error if book is not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Book not found"
Received message:   "Cannot set properties of undefined (setting 'isRead')"

      105 |       }
      106 |     }
    > 107 |     book.isRead = stryMutAct_9fa48("63") ? false : (stryCov_9fa48("63"), true);

[Killed] BooleanLiteral
src/controllers/bookController.js:35:7
 async function markAsRead(bookId) {
   const books = await readData();
   const book = books.find((b) => b.id === bookId);
-  if (!book) {
+  if (book) {
     throw new Error('Book not found');
   }
killedBy: Integration Tests POST /books/:id/markAsRead should mark a book as read
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
src/controllers/bookController.js:38:17
   if (!book) {
     throw new Error('Book not found');
   }
-  book.isRead = true;
+  book.isRead = false;
   await writeData(books);
   return book;
killedBy: Integration Tests POST /books/:id/markAsRead should mark a book as read
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/controllers/bookController.js:43:27
   return book;
 }
 
-async function getBooks() {
-  return await readData();
-}
+async function getBooks() {}
 
 async function addReview(bookId, review) {
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/controllers/bookController.js:47:42
   return await readData();
 }
 
-async function addReview(bookId, review) {
-  if (!review || typeof review !== 'string' || review.trim() === '') {
-    throw new Error(
-      "Invalid input: 'review' is required and must be a non-empty string."
-    );
-  }
-
-  const books = await readData();
-  const book = books.find((b) => b.id === bookId);
-  if (!book) {
-    throw new Error('Book not found.');
-  }
-  book.reviews.push(review);
-  await writeData(books);
-  return book;
-}
+async function addReview(bookId, review) {}
 
 async function updateBook(id, updatedFields) {
killedBy: Integration Tests POST /books/:id/review should add a review to a book
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
src/controllers/bookController.js:48:7
 }
 
 async function addReview(bookId, review) {
-  if (!review || typeof review !== 'string' || review.trim() === '') {
+  if (true) {
     throw new Error(
       "Invalid input: 'review' is required and must be a non-empty string."
killedBy: BookController addReview: should add a review to a book
statusReason: Error: Invalid input: 'review' is required and must be a non-empty string.

[Killed] BlockStatement
src/controllers/bookController.js:48:70
 }
 
 async function addReview(bookId, review) {
-  if (!review || typeof review !== 'string' || review.trim() === '') {
-    throw new Error(
-      "Invalid input: 'review' is required and must be a non-empty string."
-    );
-  }
+  if (!review || typeof review !== 'string' || review.trim() === '') {}
 
   const books = await readData();
killedBy: BookController addReview: should throw an error if review is invalid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"author": "Author 1", "genre": "Genre 1", "id": 1, "isRead": false, "reviews": [""], "title": "Test Book 1"}

[Killed] ConditionalExpression
src/controllers/bookController.js:56:7
 
   const books = await readData();
   const book = books.find((b) => b.id === bookId);
-  if (!book) {
+  if (true) {
     throw new Error('Book not found.');
   }
killedBy: Integration Tests POST /books/:id/review should add a review to a book
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[NoCoverage] StringLiteral
src/controllers/bookController.js:57:21
   const books = await readData();
   const book = books.find((b) => b.id === bookId);
   if (!book) {
-    throw new Error('Book not found.');
+    throw new Error("");
   }
   book.reviews.push(review);

[Killed] BlockStatement
src/controllers/bookController.js:64:46
   return book;
 }
 
-async function updateBook(id, updatedFields) {
-  const books = await readData();
-  console.log('Books:', books, 'Updating ID:', id); // Додано логування
-  const bookIndex = books.findIndex((book) => book.id === id);
-  if (bookIndex === -1) {
-    throw new Error(`Book with ID ${id} not found`);
-  }
-  books[bookIndex] = { ...books[bookIndex], ...updatedFields };
-  await writeData(books);
-  return books[bookIndex];
-}
+async function updateBook(id, updatedFields) {}
 
 async function deleteBook(id) {
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Updated Book Title"
Received: undefined

[Survived] StringLiteral
src/controllers/bookController.js:66:15
 
 async function updateBook(id, updatedFields) {
   const books = await readData();
-  console.log('Books:', books, 'Updating ID:', id); // Додано логування
+  console.log("", books, 'Updating ID:', id); // Додано логування
   const bookIndex = books.findIndex((book) => book.id === id);
   if (bookIndex === -1) {

[Killed] ArrowFunction
src/controllers/bookController.js:67:37
 async function updateBook(id, updatedFields) {
   const books = await readData();
   console.log('Books:', books, 'Updating ID:', id); // Додано логування
-  const bookIndex = books.findIndex((book) => book.id === id);
+  const bookIndex = books.findIndex(() => undefined);
   if (bookIndex === -1) {
     throw new Error(`Book with ID ${id} not found`);
killedBy: BookController updateBook: should update the fields of a book
statusReason: Error: Book with ID 1 not found

[Killed] ConditionalExpression
src/controllers/bookController.js:67:47
 async function updateBook(id, updatedFields) {
   const books = await readData();
   console.log('Books:', books, 'Updating ID:', id); // Додано логування
-  const bookIndex = books.findIndex((book) => book.id === id);
+  const bookIndex = books.findIndex((book) => false);
   if (bookIndex === -1) {
     throw new Error(`Book with ID ${id} not found`);
killedBy: Integration Tests PUT /books/:id should update an existing book
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/controllers/bookController.js:68:7
   const books = await readData();
   console.log('Books:', books, 'Updating ID:', id); // Додано логування
   const bookIndex = books.findIndex((book) => book.id === id);
-  if (bookIndex === -1) {
+  if (true) {
     throw new Error(`Book with ID ${id} not found`);
   }
killedBy: Integration Tests PUT /books/:id should update an existing book
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] EqualityOperator
src/controllers/bookController.js:68:7
   const books = await readData();
   console.log('Books:', books, 'Updating ID:', id); // Додано логування
   const bookIndex = books.findIndex((book) => book.id === id);
-  if (bookIndex === -1) {
+  if (bookIndex !== -1) {
     throw new Error(`Book with ID ${id} not found`);
   }
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[NoCoverage] StringLiteral
src/controllers/bookController.js:69:21
   console.log('Books:', books, 'Updating ID:', id); // Додано логування
   const bookIndex = books.findIndex((book) => book.id === id);
   if (bookIndex === -1) {
-    throw new Error(`Book with ID ${id} not found`);
+    throw new Error(``);
   }
   books[bookIndex] = { ...books[bookIndex], ...updatedFields };

[Killed] BlockStatement
src/controllers/bookController.js:76:31
   return books[bookIndex];
 }
 
-async function deleteBook(id) {
-  const books = await readData();
-  const updatedBooks = books.filter((book) => book.id !== id);
-  if (books.length === updatedBooks.length) {
-    throw new Error(`Book with ID ${id} not found`);
-  }
-  await writeData(updatedBooks);
-  return id;
-}
+async function deleteBook(id) {}
 
 module.exports = {
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
src/controllers/bookController.js:78:47
 
 async function deleteBook(id) {
   const books = await readData();
-  const updatedBooks = books.filter((book) => book.id !== id);
+  const updatedBooks = books.filter((book) => true);
   if (books.length === updatedBooks.length) {
     throw new Error(`Book with ID ${id} not found`);
killedBy: Integration Tests DELETE /books/:id should delete a book
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] MethodExpression
src/controllers/bookController.js:78:24
 
 async function deleteBook(id) {
   const books = await readData();
-  const updatedBooks = books.filter((book) => book.id !== id);
+  const updatedBooks = books;
   if (books.length === updatedBooks.length) {
     throw new Error(`Book with ID ${id} not found`);
killedBy: Integration Tests DELETE /books/:id should delete a book
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] EqualityOperator
src/controllers/bookController.js:79:7
 async function deleteBook(id) {
   const books = await readData();
   const updatedBooks = books.filter((book) => book.id !== id);
-  if (books.length === updatedBooks.length) {
+  if (books.length !== updatedBooks.length) {
     throw new Error(`Book with ID ${id} not found`);
   }
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/controllers/bookController.js:79:7
 async function deleteBook(id) {
   const books = await readData();
   const updatedBooks = books.filter((book) => book.id !== id);
-  if (books.length === updatedBooks.length) {
+  if (true) {
     throw new Error(`Book with ID ${id} not found`);
   }
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Timeout] ObjectLiteral
src/controllers/bookController.js:86:18
   return id;
 }
 
-module.exports = {
-  addBook,
-  markAsRead,
-  getBooks,
-  addReview,
-  updateBook,
-  deleteBook,
-};
+module.exports = {};
 
