[Killed] BlockStatement
src/models/Book.js:2:41
 class Book {
-  constructor(id, title, author, genre) {
-    this.id = id; // Унікальний ідентифікатор
-    this.title = title;
-    this.author = author;
-    this.genre = genre;
-    this.isRead = false;
-    this.reviews = [];
-  }
+  constructor(id, title, author, genre) {}
 
   // Метод для позначення книги як прочитаної
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Book"
Received: undefined

[Survived] BooleanLiteral
src/models/Book.js:7:19
     this.title = title;
     this.author = author;
     this.genre = genre;
-    this.isRead = false;
+    this.isRead = true;
     this.reviews = [];
   }

[Survived] ArrayDeclaration
src/models/Book.js:8:20
     this.author = author;
     this.genre = genre;
     this.isRead = false;
-    this.reviews = [];
+    this.reviews = ["Stryker was here"];
   }
 

[NoCoverage] BlockStatement
src/models/Book.js:12:16
   }
 
   // Метод для позначення книги як прочитаної
-  markAsRead() {
-    this.isRead = true;
-  }
+  markAsRead() {}
 
   // Метод для додавання відгуків

[NoCoverage] BooleanLiteral
src/models/Book.js:13:19
 
   // Метод для позначення книги як прочитаної
   markAsRead() {
-    this.isRead = true;
+    this.isRead = false;
   }
 

[NoCoverage] BlockStatement
src/models/Book.js:17:21
   }
 
   // Метод для додавання відгуків
-  addReview(review) {
-    this.reviews.push(review);
-  }
+  addReview(review) {}
 }
 
