[Timeout] BlockStatement
src/server.js:15:39
 app.use(express.json());
 
 // Маршрути
-app.get('/books', async (req, res) => {
-    const books = await getBooks();
-    res.json(books);
-});
+app.get('/books', async (req, res) => {});
 
 app.post('/books', async (req, res) => {

[Timeout] BlockStatement
src/server.js:20:40
     res.json(books);
 });
 
-app.post('/books', async (req, res) => {
-    try {
-        const { title, author, genre } = req.body;
-        const book = await addBook(title, author, genre);
-        res.status(201).json(book);
-    } catch (error) {
-        res.status(400).json({ error: error.message });
-    }
-});
+app.post('/books', async (req, res) => {});
 
 app.put('/books/:id', async (req, res) => {

[Timeout] BlockStatement
src/server.js:21:9
 });
 
 app.post('/books', async (req, res) => {
-    try {
-        const { title, author, genre } = req.body;
-        const book = await addBook(title, author, genre);
-        res.status(201).json(book);
-    } catch (error) {
+    try {} catch (error) {
         res.status(400).json({ error: error.message });
     }

[NoCoverage] BlockStatement
src/server.js:25:21
         const { title, author, genre } = req.body;
         const book = await addBook(title, author, genre);
         res.status(201).json(book);
-    } catch (error) {
-        res.status(400).json({ error: error.message });
-    }
+    } catch (error) {}
 });
 

[Timeout] BlockStatement
src/server.js:30:43
     }
 });
 
-app.put('/books/:id', async (req, res) => {
-    try {
-        console.log('Updating book with ID:', req.params.id, 'Data:', req.body); // Логування
-        const updatedBook = await updateBook(parseInt(req.params.id, 10), req.body);
-        res.json(updatedBook);
-    } catch (error) {
-        res.status(404).json({ error: error.message });
-    }
-});
+app.put('/books/:id', async (req, res) => {});
 
 app.delete('/books/:id', async (req, res) => {

[Timeout] BlockStatement
src/server.js:31:9
 });
 
 app.put('/books/:id', async (req, res) => {
-    try {
-        console.log('Updating book with ID:', req.params.id, 'Data:', req.body); // Логування
-        const updatedBook = await updateBook(parseInt(req.params.id, 10), req.body);
-        res.json(updatedBook);
-    } catch (error) {
+    try {} catch (error) {
         res.status(404).json({ error: error.message });
     }

[NoCoverage] BlockStatement
src/server.js:35:21
         console.log('Updating book with ID:', req.params.id, 'Data:', req.body); // Логування
         const updatedBook = await updateBook(parseInt(req.params.id, 10), req.body);
         res.json(updatedBook);
-    } catch (error) {
-        res.status(404).json({ error: error.message });
-    }
+    } catch (error) {}
 });
 

[Timeout] BlockStatement
src/server.js:40:46
     }
 });
 
-app.delete('/books/:id', async (req, res) => {
-    try {
-        const deletedId = await deleteBook(parseInt(req.params.id, 10));
-        res.json({ deletedId });
-    } catch (error) {
-        res.status(404).json({ error: error.message });
-    }
-});
+app.delete('/books/:id', async (req, res) => {});
 
 app.post('/books/:id/review', async (req, res) => {

[Killed] StringLiteral
src/server.js:40:12
     }
 });
 
-app.delete('/books/:id', async (req, res) => {
+app.delete("", async (req, res) => {
     try {
         const deletedId = await deleteBook(parseInt(req.params.id, 10));
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Timeout] BlockStatement
src/server.js:41:9
 });
 
 app.delete('/books/:id', async (req, res) => {
-    try {
-        const deletedId = await deleteBook(parseInt(req.params.id, 10));
-        res.json({ deletedId });
-    } catch (error) {
+    try {} catch (error) {
         res.status(404).json({ error: error.message });
     }

[NoCoverage] BlockStatement
src/server.js:44:21
     try {
         const deletedId = await deleteBook(parseInt(req.params.id, 10));
         res.json({ deletedId });
-    } catch (error) {
-        res.status(404).json({ error: error.message });
-    }
+    } catch (error) {}
 });
 

[NoCoverage] ObjectLiteral
src/server.js:45:30
         const deletedId = await deleteBook(parseInt(req.params.id, 10));
         res.json({ deletedId });
     } catch (error) {
-        res.status(404).json({ error: error.message });
+        res.status(404).json({});
     }
 });

[Timeout] BlockStatement
src/server.js:49:51
     }
 });
 
-app.post('/books/:id/review', async (req, res) => {
-    try {
-        const updatedBook = await addReview(parseInt(req.params.id, 10), req.body.review);
-        res.json(updatedBook);
-    } catch (error) {
-        res.status(400).json({ error: error.message });
-    }
-});
+app.post('/books/:id/review', async (req, res) => {});
 
 app.post('/books/:id/markAsRead', async (req, res) => {

[Timeout] BlockStatement
src/server.js:50:9
 });
 
 app.post('/books/:id/review', async (req, res) => {
-    try {
-        const updatedBook = await addReview(parseInt(req.params.id, 10), req.body.review);
-        res.json(updatedBook);
-    } catch (error) {
+    try {} catch (error) {
         res.status(400).json({ error: error.message });
     }

[NoCoverage] BlockStatement
src/server.js:53:21
     try {
         const updatedBook = await addReview(parseInt(req.params.id, 10), req.body.review);
         res.json(updatedBook);
-    } catch (error) {
-        res.status(400).json({ error: error.message });
-    }
+    } catch (error) {}
 });
 

[Killed] BlockStatement
src/server.js:58:55
     }
 });
 
-app.post('/books/:id/markAsRead', async (req, res) => {
-    try {
-        const updatedBook = await markAsRead(parseInt(req.params.id, 10));
-        res.json(updatedBook);
-    } catch (error) {
-        res.status(404).json({ error: error.message });
-    }
-});
+app.post('/books/:id/markAsRead', async (req, res) => {});
 
 module.exports = app;
killedBy: Integration Tests POST /books/:id/markAsRead should mark a book as read
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/server.js:59:9
 });
 
 app.post('/books/:id/markAsRead', async (req, res) => {
-    try {
-        const updatedBook = await markAsRead(parseInt(req.params.id, 10));
-        res.json(updatedBook);
-    } catch (error) {
+    try {} catch (error) {
         res.status(404).json({ error: error.message });
     }
killedBy: Integration Tests POST /books/:id/markAsRead should mark a book as read
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
