[Killed] BlockStatement
src/utils/fileHandler.js:7:27
 const idTrackerPath = path.resolve(__dirname, '../../data/idTracker.json');
 
 // Зчитування даних книг
-async function readData() {
-  try {
-    const data = await fs.readFile(filePath, 'utf-8');
-    return JSON.parse(data);
-  } catch (err) {
-    console.error('Error reading data:', err.message);
-    return [];
-  }
-}
+async function readData() {}
 
 // Запис даних книг
killedBy: Integration Tests GET /books should return all books
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"author": "Author 1", "genre": "Genre 1", "id": 1, "isRead": false, "reviews": [], "title": "Book 1"}, {"author": "Author 2", "genre": "Genre 2", "id": 2, "isRead": false, "reviews": [], "title": "Book 2"}]
Received: ""

[Killed] BlockStatement
src/utils/fileHandler.js:8:7
 
 // Зчитування даних книг
 async function readData() {
-  try {
-    const data = await fs.readFile(filePath, 'utf-8');
-    return JSON.parse(data);
-  } catch (err) {
+  try {} catch (err) {
     console.error('Error reading data:', err.message);
     return [];
killedBy: Integration Tests GET /books should return all books
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"author": "Author 1", "genre": "Genre 1", "id": 1, "isRead": false, "reviews": [], "title": "Book 1"}, {"author": "Author 2", "genre": "Genre 2", "id": 2, "isRead": false, "reviews": [], "title": "Book 2"}]
Received: ""

[NoCoverage] BlockStatement
src/utils/fileHandler.js:11:17
   try {
     const data = await fs.readFile(filePath, 'utf-8');
     return JSON.parse(data);
-  } catch (err) {
-    console.error('Error reading data:', err.message);
-    return [];
-  }
+  } catch (err) {}
 }
 

[NoCoverage] ArrayDeclaration
src/utils/fileHandler.js:13:12
     return JSON.parse(data);
   } catch (err) {
     console.error('Error reading data:', err.message);
-    return [];
+    return ["Stryker was here"];
   }
 }

[Killed] BlockStatement
src/utils/fileHandler.js:18:32
 }
 
 // Запис даних книг
-async function writeData(data) {
-  try {
-    await fs.writeFile(filePath, JSON.stringify(data, null, 2));
-  } catch (err) {
-    console.error('Error writing data:', err.message);
-  }
-}
+async function writeData(data) {}
 
 // Зчитування останнього ID
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/utils/fileHandler.js:19:7
 
 // Запис даних книг
 async function writeData(data) {
-  try {
-    await fs.writeFile(filePath, JSON.stringify(data, null, 2));
-  } catch (err) {
+  try {} catch (err) {
     console.error('Error writing data:', err.message);
   }
killedBy: E2E Tests Create a new book and validate the flow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[NoCoverage] BlockStatement
src/utils/fileHandler.js:21:17
 async function writeData(data) {
   try {
     await fs.writeFile(filePath, JSON.stringify(data, null, 2));
-  } catch (err) {
-    console.error('Error writing data:', err.message);
-  }
+  } catch (err) {}
 }
 

[NoCoverage] BlockStatement
src/utils/fileHandler.js:27:29
 }
 
 // Зчитування останнього ID
-async function readLastId() {
-  try {
-    const data = await fs.readFile(idTrackerPath, 'utf-8');
-    const parsedData = JSON.parse(data);
-    return parsedData.lastId;
-  } catch (err) {
-    console.error('Error reading last ID:', err.message);
-    return 0; // Якщо файл не існує, почнемо з ID 0
-  }
-}
+async function readLastId() {}
 
 // Оновлення останнього ID

[NoCoverage] BlockStatement
src/utils/fileHandler.js:28:7
 
 // Зчитування останнього ID
 async function readLastId() {
-  try {
-    const data = await fs.readFile(idTrackerPath, 'utf-8');
-    const parsedData = JSON.parse(data);
-    return parsedData.lastId;
-  } catch (err) {
+  try {} catch (err) {
     console.error('Error reading last ID:', err.message);
     return 0; // Якщо файл не існує, почнемо з ID 0

[NoCoverage] BlockStatement
src/utils/fileHandler.js:32:17
     const data = await fs.readFile(idTrackerPath, 'utf-8');
     const parsedData = JSON.parse(data);
     return parsedData.lastId;
-  } catch (err) {
-    console.error('Error reading last ID:', err.message);
-    return 0; // Якщо файл не існує, почнемо з ID 0
-  }
+  } catch (err) {}
 }
 

[NoCoverage] BlockStatement
src/utils/fileHandler.js:39:36
 }
 
 // Оновлення останнього ID
-async function updateLastId(newId) {
-  try {
-    await fs.writeFile(
-      idTrackerPath,
-      JSON.stringify({ lastId: newId }, null, 2)
-    );
-  } catch (err) {
-    console.error('Error updating last ID:', err.message);
-  }
-}
+async function updateLastId(newId) {}
 
 module.exports = { readData, writeData, readLastId, updateLastId };

[NoCoverage] BlockStatement
src/utils/fileHandler.js:40:7
 
 // Оновлення останнього ID
 async function updateLastId(newId) {
-  try {
-    await fs.writeFile(
-      idTrackerPath,
-      JSON.stringify({ lastId: newId }, null, 2)
-    );
-  } catch (err) {
+  try {} catch (err) {
     console.error('Error updating last ID:', err.message);
   }

[NoCoverage] BlockStatement
src/utils/fileHandler.js:45:17
       idTrackerPath,
       JSON.stringify({ lastId: newId }, null, 2)
     );
-  } catch (err) {
-    console.error('Error updating last ID:', err.message);
-  }
+  } catch (err) {}
 }
 
